#Data Import

In [27]:
import pandas as pd

first_train = pd.read_csv("train.csv")
first_test=pd.read_csv("test.csv")
submit=pd.read_csv("submission.csv")
first_train.head()

   store_id        date      time  ... installments  days_of_week  holyday
0         0  2016-12-14  18:05:31  ...          NaN             2        0
1         0  2016-12-14  18:05:54  ...          NaN             2        0
2         0  2016-12-19  12:42:31  ...          NaN             0        0
3         0  2016-12-19  12:48:08  ...          NaN             0        0
4         0  2016-12-19  13:31:08  ...          NaN             0        0

[5 rows x 8 columns]

In [28]:
train=first_train.copy()
test=first_test.copy()

In [29]:
train.shape

(3362796, 8)

In [30]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3362796 entries, 0 to 3362795
Data columns (total 8 columns):
 #   Column        Dtype
---  ------        -----
 0   store_id      int64
 1   date          object
 2   time          object
 3   card_id       object
 4   amount        int64
 5   installments  float64
 6   days_of_week  int64
 7   holyday       int64
dtypes: float64(1), int64(4), object(3)
memory usage: 205.2+ MB

In [31]:
train["store_id"].unique()

array([   0,    1,    2, ..., 1797, 1798, 1799])

In [32]:
test.head(5)

   store_id        date      time  ... installments  days_of_week  holyday
0         0  2016-08-01  00:28:15  ...          NaN             0        0
1         0  2016-08-01  01:09:58  ...          NaN             0        0
2         0  2016-08-01  01:47:24  ...          NaN             0        0
3         0  2016-08-01  17:54:43  ...          NaN             0        0
4         0  2016-08-01  18:48:53  ...          NaN             0        0

[5 rows x 8 columns]

In [33]:
submit.head()

   store_id  total_sales
0         0            0
1         1            0
2         2            0
3         3            0
4         4            0

#Data Preprocessing

In [34]:
train=train.fillna(0)

##Installments & card_id

In [35]:
#installment:할부개월수, NaN=일시불->0으로 채움
train['installments']=train['installments'].fillna(0)

#활용 가능성이 보이면 넣고 아니면 필요 없을 듯해서 drop
train=train.drop(columns=['card_id'])

train[100:110]

     store_id        date      time  ...  installments  days_of_week  holyday
100         0  2016-12-20  20:01:43  ...           0.0             1        0
101         0  2016-12-20  20:08:04  ...           0.0             1        0
102         0  2016-12-20  20:12:27  ...           0.0             1        0
103         0  2016-12-20  20:28:12  ...           0.0             1        0
104         0  2016-12-20  20:39:58  ...           0.0             1        0
105         0  2016-12-20  20:40:44  ...           0.0             1        0
106         0  2016-12-20  20:41:30  ...           0.0             1        0
107         0  2016-12-20  20:42:28  ...           0.0             1        0
108         0  2016-12-20  20:56:19  ...           0.0             1        0
109         0  2016-12-20  20:58:15  ...           0.0             1        0

[10 rows x 7 columns]

##One hot encoding

In [36]:
train=pd.get_dummies(train,columns=['days_of_week'])
train.head(5)

   store_id        date  ... days_of_week_5  days_of_week_6
0         0  2016-12-14  ...              0               0
1         0  2016-12-14  ...              0               0
2         0  2016-12-19  ...              0               0
3         0  2016-12-19  ...              0               0
4         0  2016-12-19  ...              0               0

[5 rows x 13 columns]

##Date + time

In [37]:
import numpy as np
train['datetime']=np.NaN

datetime=train['datetime'].copy()

for i in range(0,len(train)):
    datetime[i]=train.loc[i,'date']+" "+train.loc[i,'time']


# train.loc[i,'datetime']=pd.to_datetime(tmp,format="%Y-%m-%d %H:%M:%S")

KeyboardInterrupt: ignored

##Store_id 로 나누기

In [38]:
import numpy as np

storeId=np.unique(train['store_id'])

for i in storeId:

    #boolean indexing 사용
    valid_store_id=train['store_id']==i

    split_train=train[valid_store_id]

In [39]:
split_train

         store_id        date  ... days_of_week_6  datetime
3362359      1799  2017-03-10  ...              0       NaN
3362360      1799  2017-03-10  ...              0       NaN
3362361      1799  2017-03-11  ...              0       NaN
3362362      1799  2017-03-12  ...              1       NaN
3362363      1799  2017-03-13  ...              0       NaN
...           ...         ...  ...            ...       ...
3362791      1799  2018-07-19  ...              0       NaN
3362792      1799  2018-07-19  ...              0       NaN
3362793      1799  2018-07-22  ...              1       NaN
3362794      1799  2018-07-25  ...              0       NaN
3362795      1799  2018-07-30  ...              0       NaN

[437 rows x 14 columns]